"""
Переменная - это элементарная единица хранения данных
Основные типы данных:
    int (целые числа),
    float (числа с плавающей точкой),
    str (строки),
    bool (булевы значения).
"""
name = 'Nikolay'        
print(name)

"""
Значение переменных можно изменить в процессе работы
"""
name = 'Urban' 
print(name)

"""
Существует 2 способа именнования переменных
"""
date_of_brith = 'April 1998'        #snake case разделение слов в назывании переменных нижним подчёркиванием
dateOfBirth = 'April 1998'      #camel case разделение слов в названии переменныхзаглавными буквами
