"""
Переменные в Python — это области памяти компьютера, 
которые используются для хранения обрабатываемых программой данных. 
У них есть имя (задается программистом), значение (информация для обработки) 
и тип (определяет область значений и осуществляемых над ними операций)
Основные типы данных:
    int (целые числа),
    float (числа с плавающей точкой),
    str (строки),
    bool (булевы значения).
"""
name = 'Nikolay'        
print(name)

"""
Значение переменных можно изменить в процессе работы
"""
name = 'Urban' 
print(name)

"""
Существует 2 способа именнования переменных
"""
date_of_brith = 'April 1998'        #snake case разделение слов в назывании переменных нижним подчёркиванием
dateOfBirth = 'April 1998'      #camel case разделение слов в названии переменныхзаглавными буквами
