"""
Самостоятельная работа по уроку "Цели и задачи. Поток выполнения программы. Как интерпретатор показывает переменные."
    1. Создайте новый проект
    2. В файл main.py добавьте следующий код:
        print('Hi, PyCharm')
        x = 43
        y = 32
        print(x * y)
        print("End line")
Ваша задача:
    1.Запустите проект нажав на иконку дебага справа от запуска проекта "жучок"
    2.В консоли посмотрите на результат программы
    3.Используйте Step Over (см. скриншот) для перехода к следующему шагу выполнения программы
    4.Посмотрите на консоль и на ход выполнения программы
    5.Приложите скриншот (изображение), написанного кода
"""
print('Hi, PyCharm')
x = 43
y = 32
print(x * y)
print("End line")
